"""
5. Программа запрашивает у пользователя строку чисел, разделенных пробелом. При нажатии Enter должна выводиться сумма чисел. 
Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter. 
Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме. Но если вместо числа вводится специальный символ, выполнение программы завершается. 
Если специальный символ введен после нескольких чисел, то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.
"""


def calc_sum():
    my_sum = 0
    while True:
        tmp = input(
            'Введите строку чисел через пробел (Для заверешения программы введите q)\n')
        try:
            num_list = tmp.split()
        except ValueError:
            continue

        con = 1
        for itm in num_list:
            if itm == 'q':
                con = 0
                break
            try:
                num = float(itm)
            except TypeError:
                continue
            except ValueError:
                continue

            my_sum = my_sum + num
        if con == 0:
            break
        print(my_sum)
    return my_sum


print(calc_sum())
