print("""
5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел. 
У пользователя необходимо запрашивать новый элемент рейтинга. 
Если в рейтинге существуют элементы с одинаковыми значениями, то новый элемент с тем же значением должен разместиться после них.
""")

my_list = [9, 7, 7, 6, 6, 6, 5, 4, 4]
print(f"Заданный список натуральных чисел: {my_list}\n")

while True:
    var_input = input(
        'Введите натуральное число. (Для завершения введите слово end)\n')
    if var_input == "end":
        break
    elif var_input.isdigit() and int(var_input) > 0:
        my_list.append(int(var_input))
    else:
        print('Введено некорректное значение. Повторите ввод\n')

my_list.sort(reverse=True)
print(f"Отсортированный список: {my_list}")
