print("""
4. Пользователь вводит строку из нескольких слов, разделённых пробелами. Вывести каждое слово с новой строки. 
Строки необходимо пронумеровать. Если в слово длинное, выводить только первые 10 букв в слове.
""")

while True:
    var_string = input(
        'Введите строку из нескольких слов, разделенных пробелами\n')
    if not var_string == "":
        break
    else:
        print('Введено некорректное значение. Повторите ввод\n')

i = 1
for word in var_string.split(' '):
    print(f"{i}. {word[0:10]}")
    i += 1
