"""
4. Представлен список чисел. Определить элементы списка, не имеющие повторений. 
Сформировать итоговый массив чисел, соответствующих требованию. Элементы вывести в порядке их следования в исходном списке. 
Для выполнения задания обязательно использовать генератор.
"""

import my_module.my_func as my_func

my_list = my_func.get_randomint_list(20, 0, 100)
print(f'Исходный список:\n{my_list}')

new_list = (
    itm for itm in my_list if not new_list.count(itm)
)

print(f'Результат:\n{list(new_list)}')
