print("""
5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел. 
У пользователя необходимо запрашивать новый элемент рейтинга. 
Если в рейтинге существуют элементы с одинаковыми значениями, то новый элемент с тем же значением должен разместиться после них.
""")

my_list = [9, 7, 7, 6, 6, 6, 5, 4, 4]
print(f"Заданный список натуральных чисел: {my_list}\n")

while True:
    var_input = input(
        'Введите натуральное число. (Для завершения введите слово end)\n')
    if var_input == "end":
        break
    elif var_input.isdigit() and int(var_input) > 0:
        num = int(var_input)
        # числа нет в списке my_list и оно меньше или равно последнего -> добавляем в конец
        # введенное число равно последнему числу в списке -> добавляем в конец
        if (my_list.count(num) == 0 and num <= my_list[-1]) or (num == my_list[-1]):
            my_list.append(num)
            print(f"Отсортированный список: {my_list}")
            continue

        for ind, item in enumerate(my_list):
            if num > item:
                my_list.insert(ind, num)
                print(f"Отсортированный список: {my_list}")
                break
    else:
        print('Введено некорректное значение. Повторите ввод\n')
