"""
6. Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
практических и лабораторных занятий по этому предмету и их количество. Важно, чтобы для каждого предмета не обязательно были все типы занятий. 
Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.
"""

file_input = 'exam6_data.txt'

try:
    with open(file_input, 'r', encoding='UTF-8') as f_in:
        pass
except IOError:
    print("Произошла ошибка записи в файл")


# {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
